Table of Contents
 Class ConcreteCheckDetailingEc2
Namespace
IdeaRS.OpenModel.Concrete.CheckResult
Assembly
IdeaRS.OpenModel.dll
Check Detailing Ec2
public class ConcreteCheckDetailingEc2 : ConcreteCheckDetailing
Inheritance
object
ConcreteCheckResultBase
ConcreteCheckDetailing
ConcreteCheckDetailingEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CheckValueLongReinf
check value of longitudinal reinforcement
public double CheckValueLongReinf { get; set; }
Property Value
double
 CheckValueShearReinf
check value of shear reinforcement
public double CheckValueShearReinf { get; set; }
Property Value
double
 Edit this page